import { Component, OnInit } from '@angular/core';
import { PrimengListModule } from '../../../primeng-list.module';

@Component({
  selector: 'app-faq',
  standalone: true,
  imports: [PrimengListModule],
  templateUrl: './faq.component.html',
  styleUrls: ['./faq.component.scss']
})
export class FaqComponent implements OnInit {
  faqs: any[] = [
    { id: 0, question: "من چرا به یک وب سایت نیاز دارم؟", reply: "تاثیرات وب و اینترنت بر کسی پوشیده نیست امروزه همه کارا اینترنتی شده چون کسی حوصله نداره و یا بخاطر ترافیک و یا کمبود وقت نمیرسن خیلی کارهارو انجام بدن و براشون بصرفه تره این کارارو اینترنتی انجام بدن حالا تو این عرصه کسی موفق تره که زودتر اقدام کنه الان تعریف مردم از رفاه فرق کرده و رفا رو توی دسترسی اسون تر و سریعتر میبینن همونطور که کنسرسیوم جهانی وب W3C اعلام کردم تا سال 2021 بیش از 80 درصد تمرکز دنیا میره روی اینترنت و بقیش میشه تلویزیون روزنامه و رادیو پس این یعنی سهم بسیار زیادی رو تشکیل میده و اگه الان اقدام نکنید در آینده شانسی برای رقابت توی بازار رو ندارید." },
    { id: 1, question: "داشتن وب سایت چه کمکی به کسب و کار من میتونه بکنه؟", reply: "خب مشتریانتون وقتی ببینن به حقوق شهروندیشون (که الان دسترسی به خدمات اینترنتیه ) احترام گذاشته میشه مسلما مشتری ثابت شما میمونن از طرفی تعریف شمارو پیش اطرافیان میکنن به عنوان یک فرد نوآور معرفیتون این یک طرف قضیس طرف دیگش اینه خیلیا شمارو نمیشناسن و از طریق وب با شما آشنا میشن و میشن مشتریتون پس کلا داشتنش ضرری نداره و وجودش ضروریه" },
    { id: 2, question: "آیا یک وب سایت میتونه به اعتبار من اضافه کنه؟", reply: "قدیما وقتی یکی کت شلوار شیک میپوشید میرفت روی اعتبارش همه میگفتن به به معلومه ادم معتبریه الانم اعتبار صنفی شما به داشتن یک وب سایت بستگی داره روی کارت ویزیت شما ادرس سایتتون بخوره یا توی کاتالوگ و برشورتون متوجه میشید که چقد دید مخاطب فرق میکنه چون تو دلشون میگن اینا یک وب سایت دارن پس حتما شناخته شده هستن میگه حتما خدمتی داره که قابل عرضه به همه دنیا هست.  " },
    { id: 3, question: "هزینه طراحی سایت چگونه محاسبه میشه؟", reply: "با توجه به خدماتی که میخواهید سایتتون داشته باشه هزینه از بین 10 تا 100 میلیون تومان برای شما ارائه میشه ممکنه کارتون خیلی اختصاصی باشه بیشتر از این مقدار باشه ولی به این نکته توجه کنید در مقابل پولی که دارید پرداخت میکنید چی دارید دریافت میکنید پنجره جدیدی از کسب و کار به روتون باز میشه.نصف هزینه هنگام عقد قرارداد و بقیش موقع تحویل سایت از مشتری دریافت میشه.  " },
  ];

  events = [
    { status: 'ورود', data: 'ورود به سایت و لاگین با شماره موبایل', icon: 'pi pi-sign-in', color: '#ce243e' },
    { status: 'افزودن به سبد', data: 'انتخاب محصول و افزودن به سبد خرید', icon: 'pi pi-cart-plus', color: '#9C27B0' },
    { status: 'حساب کاربری', data: 'تکمیل فرم مشخصات کاربری', icon: 'pi pi-user', color: '#FF9800' },
    { status: 'ثبت آدرس', data: 'ثبت و انتخاب آدرس جهت دریافت کالا', icon: 'pi pi-map-marker', color: '#607D8B' },
    { status: 'درگاه پرداخت', data: 'اتصال به درگاه پرداخت و پرداخت هزینه کالا', icon: 'pi pi-money-bill', color: '#673AB7' },
    { status: 'تایید سفارش', data: 'ثبت نهایی سفارش و دریافت پیامک تایید سفارش', icon: 'pi pi-check-circle', color: 'green' },
  ];
  constructor() { }

  ngOnInit(): void {
  }


}
